<?php

$seoul_arr=[
    '서울', '강남', '역삼', '삼성', '신사', '청담', '서초', '교대', '잠실', '송파', '왕십리', '강동', '을지로', '시청', '명동', '종로', '인사동', '동대문', '강북', '서울역', '이태원', '용산', '마포', '홍대', '신촌', '서대문', '영등포', '여의도', '김포공항', '구로', '금천', '관악', '동작',
];

$busan_arr=[
    '부산', '해운대', '광안리', '기장', '부산역', '남포', '자갈치', '영도', '서면', '동래', '연제', '남구', '김해공항',
];

$jeju_arr=[
    '제주도', '제주공항', '애월', '함덕', '서귀포시', '중문', '표선', '성산', '우도',
];
$kangwon_arr=[
    '강원도', '강릉', '속초', '양양', '동해', '고성', '삼척', '춘천', '홍천', '인제', '철원', '평창', '정선', '횡성', '영월', '원주', '태백', '울릉도', '독도',
];
$kyeongki_arr=[
    '경기도', '수원', '성남', '용인', '평택', '화성', '안산', '부천', '안양', '고양', '의정부', '파주', '김포', '시흥', '군포', '광명', '남양주시', '구리', '하남', '가평', '양평', '경기도 광주', '의왕', '일산', '포천', '양주', '동두천', '연평도',
];
$incheon_arr=[
    '인천', '송도', '남동구', '웅진군', '인천국제공항', '중구', '부평', '계양', '서구', '미추홀구', '강화','소래포구',
];
$kyeonsang_arr=[
    '경상도', '경주', '포항', '울진', '영덕', '거제', '통영', '대구', '구미', '문경', '안동', '울산', '양산', '창원', '김해', '창녕', '사천', '남해', '진주', '함양',
];
$jeonra_arr=[
    '전라도', '여수', '전주', '광주', '광양', '구례', '순천', '화순', '남원', '군산', '익산', '부안', '진안', '무주', '목포', '나주', '완도', '해남', '영남', '벌교',
];
$choongcheong_arr=[
    '충청도', '대전', '천안', '아산', '예산', '당진', '보령', '서산', '태안', '청주', '제천', '충주', '보은', '금산', '공주',
];

$spot_arr=[
    '서울'=>$seoul_arr,
    '부산'=>$busan_arr,
    '제주도'=>$jeju_arr,
    '강원도'=>$kangwon_arr,
    '경기도'=>$kyeongki_arr,
    '인천'=>$incheon_arr,
    '경상도'=>$kyeonsang_arr,
    '전라도'=>$jeonra_arr,
    '충청도'=>$choongcheong_arr
];
?>